package by.epam.les02.main;

public class Task07 {
	// Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
	public static void main(String[] args) {
		double a, b, c;
		a = 4.24;
		b = 2 * a;
		c = a * b;
		System.out.printf("c = %.2f", c);
	}

}
